#### ParameterUtils Members

---

|  |
| --- |
| ParameterUtils Class   Methods   See Also |

The  ParameterUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAllBuiltInGroups | Gets the identifiers of all built-in parameter groups. |
| Public method Static member | GetAllBuiltInParameters | Gets the identifiers of all built-in parameters. |
| Public method Static member | GetBuiltInParameter | Gets the BuiltInParameter value corresponding to built-in parameter identified by the given ForgeTypeId. |
| Public method Static member | GetBuiltInParameterGroup | Gets the BuiltInParameterGroup value corresponding to built-in parameter group identified by the given ForgeTypeId. |
| Public method Static member | GetParameterGroupTypeId | Gets the ForgeTypeId identifying the built-in parameter group corresponding to BuiltInParameterGroup value. |
| Public method Static member | GetParameterTypeId | Gets the ForgeTypeId identifying the built-in parameter corresponding to the given BuiltInParameter value. |
| Public method Static member | IsBuiltInGroup | Checks whether a ForgeTypeId identifies a built-in parameter group. |
| Public method Static member | IsBuiltInParameter(ElementId) | Checks whether an ElementId identifies a built-in parameter. |
| Public method Static member | IsBuiltInParameter(ForgeTypeId) | Checks whether a ForgeTypeId identifies a built-in parameter. |

# See Also

ParameterUtils Class

Autodesk.Revit.DB Namespace